Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: རྟོག་པ་དང་དཔྱོད་པ་འདི་དག་སྤངས་ན་དེའི་སྐྱེ་བ་མི་འཇུག་སྟེ་དེ་ཡང་དང་ཡང་དུ་སྐྱེ་བ་མི་འཇུག་པ་འདི་ནི་མྱ་ངན་ལས་འདའ་བ་ཐོབ་བོ་སྙམ་མོ། །
en: ‘Now that I am rid of conception and discernment, there will be no more rebirth. With no need to continue taking rebirth, I have achieved nirvāṇa.’

source: དེ་ལྟར་བཟོད་པ་དང་སྣང་བ་ལ་དགའ་བ་དེ་དག་ལ་འོད་གསལ་གྱི་གཞལ་མེད་ཁང་དག་བྱུང་བར་གྱུར་ཏོ། །
en: So pleased with their state of acceptance and experiences, luminous celestial palaces manifested before them.

source: དེ་ལྟར་གཞལ་མེད་ཁང་དེ་དག་མཐོང་ནས་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: Beholding those palaces, however, they had the thought,

source: མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་འདི་ནི་ལོག་པར་འཛིན་པའོ། །
en: ‘This so-called nirvāṇa is a fallacy.

source: གང་དགེ་སྦྱོང་དང་བྲམ་ཟེ་མྱ་ངན་ལས་འདས་པར་སྨྲ་བ་དེ་དག་ནི་ལོག་པར་ཞུགས་པའོ། །
en: Those mendicants and brahmins who preach about nirvāṇa are misguided.

source: མྱ་ངན་ལས་འདས་པ་ལ་ནི་གཞལ་མེད་ཁང་མེད་དོ་སྙམ་ནས།
en: Because there cannot be a celestial palace in the state of nirvāṇa.’

source: དེ་དག་མཐོང་བ་ཐོབ་མ་ཐག་ཏུ་གཞལ་མེད་ཁང་དེ་དག་མི་སྣང་བར་གྱུར་ཅིང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་བར་གྱུར་ཏོ། །
en: In fact, as soon as they beheld them, the celestial palaces disappeared, and they fell into the great hell realms.

source: དེའི་ཚེ་བྲམ་ཟེ་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་ཞིང་རྣམ་པར་ལྟ་བ་པ་ཤེས་པ་སྣ་ཚོགས་ཡོད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “At this time there was a brahmin known as Possessor of Myriad Knowledges who had the five superknowledges as well as extraordinary vision.

source: དེས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ཞུགས་པ་དེ་དག་མཐོང་ནས་དེ་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: He could see those beings who had ended up in the great hell, and thought to himself,

source: ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་རབ་ཏུ་ཉམས་པ་སྟེ།
en: ‘Alas, the state of this world is really in decline.

source: འདི་ལྟར་སེམས་ཅན་ལོག་པར་འཛིན་པ་འདི་དག་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་རབ་ཏུ་ལྟུང་ངོ་སྙམ་མོ། །
en: These beings’ misconceptions have landed them in the great hell.’

source: དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་མཉམ་པར་གཞག་པ་ལ་ཇི་ལྟར་སེམས་མཉམ་པར་གཞག་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་དེས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་བསིལ་བར་བྱས་སོ། །བསིལ་བར་བྱས་ནས་སྒྲ་ཕྱུང་བ།
en: With this in mind he rested in a state of absorption, and by the miraculous powers created by his equilibrium, all those beings in the great hell were cooled. They also heard a voice saying,

source: ཀྱེ་སེམས་ཅན་དག་མྱ་ངན་ལས་འདས་པ་ཡོད་དེ།
en: ‘Listen, all of you!

source: ཁྱོད་ཀྱིས་སྔོན་མྱ་ངན་ལས་འདས་པ་མ་ཐོས་ཤིང་།
en: There is a nirvāṇa—you have just not heard about it.

source: ཁྱོད་ཀྱིས་མྱ་ངན་ལས་འདས་པ་མ་ཡིན་པ་ལ་མྱ་ངན་ལས་འདས་པར་འདུ་ཤེས་ཏེ། དེས་ན་ཁྱེད་ཅག་དམྱལ་བར་སྐྱེས་སོ། །
en: You have come to take something that is not nirvāṇa to be nirvāṇa—this is why you were reborn in hell.

source: ཁྱེད་ཅག་གིས་ལྟ་བར་གྱུར་པ་འདི་དག་ལེགས་པར་ཐོང་ཤིག །
en: You all must totally give up these ideas!

source: འོན་ཏང་ཁྱེད་ཅག་མྱ་ངན་ལས་འདས་པ་འཐོབ་བོ། །
en: If you do, you will achieve nirvāṇa!’

source: སེམས་ཅན་དེ་དག་གིས་དེའི་ཚིག་དེ་ཐོས་ནས་ལྟ་བར་གྱུར་པ་དེ་དག་བཏང་སྟེམྱ་ངན་ལས་འདས་པའི་འདུ་ཤེས་སྐྱེས་སོ། །
en: When the beings heard these words, they gave up their ideas and again conceived of nirvāṇa.

source: དེ་དག་མྱ་ངན་ལས་འདས་པའི་འདུ་ཤེས་སྐྱེས་མ་ཐག་ཏུ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་ལས་ཤིའོ། །དེ་ཤི་ནས་སྟོན་པ་ཤེས་པ་སྣ་ཚོགས་ཡོད་པ་དེའི་དྲུང་དུ་ལྷགས་སོ། །
en: As soon as they did so, they died within their existence in the great hell and were transported into the presence of the teacher Possessor of Myriad Knowledges.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་སྟོན་པ་ཤེས་པ་སྣ་ཚོགས་ཡོད་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the teacher Possessor of Myriad Knowledges was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་སྟོན་པ་ཤེས་པ་སྣ་ཚོགས་ཡོད་པར་གྱུར་ཏོ། །
en: In those days I was the teacher Possessor of Myriad Knowledges.

source: མཽད་གལ་གྱི་བུ་སེམས་ཅན་དག་ཡུན་རིང་པོ་ནས་ལོག་པར་མངོན་པར་ཞེན་པས་བསླུས་ཏེ།
en: Maudgalyāyana, for long sentient beings have been deceived by misconceptions.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ལོག་པས་མངོན་པར་ཞེན་པ་ལ་མངོན་པར་ཞེན་པ་མེད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should rid themselves of observing distorted conceptions.

source: ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱི་ཤེས་པ་ལ་རབ་ཏུ་འབད་པར་བྱའོ། །
en: They should apply effort to understand the essential characteristics of phenomena.

source: དགེ་བའི་བཤེས་གཉེན་ཡང་ཡོངས་སུ་བཙལ་བར་བྱའོ། །
en: They should also seek out spiritual guides.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་དགེ་བའི་བཤེས་གཉེན་དང་འབྲེལ་པའོ། །
en: “Maudgalyāyana, the ‘awakening’ of bodhisattvas happens in association with a spiritual guide.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་བསྟེན་པར་མི་བྱ།
en: Maudgalyāyana, bodhisattvas should not follow the vehicle of the hearers;

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་བསྟེན་པར་མི་བྱའོ། །
en: neither should they follow the vehicle of the solitary buddhas.

source: ཚུལ་ཁྲིམས་འཆལ་པ་དང་། ལོག་པར་ལྟ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡིག་པའི་གྲོགས་པོ་མ་ཡིན་གྱི། གཞན་དུ་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོ་ཡིན་ནོ། །
en: Faulty discipline and wrong views are not a bad influence on bodhisattvas compared to the negative influence that the vehicles of the hearers and solitary buddhas have on them.

source: ཚུལ་ཁྲིམས་འཆལ་པས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་གཞིག་པར་མི་ནུས། ལོག་པར་ལྟ་བས་བྱང་ཆུབ་སེམས་དཔའི་ལྟ་བ་གཞིག་པར་མི་ནུས་སོ། །
en: Faulty discipline cannot ruin a bodhisattva’s discipline, nor can wrong views ruin a bodhisattva’s view.

source: ཚུལ་ཁྲིམས་འཆལ་པས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་འཆལ་པར་བྱ་མི་ནུས། ལྟ་བ་ལོག་པས་བྱང་ཆུབ་སེམས་དཔའི་ལྟ་བ་ལོག་པར་བྱ་མི་ནུས་ཀྱི། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཟག་པ་མེད་པའི་ཤེས་པ་ལ་འཇུག་པར་མི་ནུས་སོ། །
en: Faulty discipline cannot make a bodhisattva’s discipline faulty, nor can wrong views distort a bodhisattva’s view. However, the adherents of the vehicle of the hearers and the vehicle of the solitary buddhas cannot lead bodhisattvas to undefiled knowledge.

source: དེ་ལྟ་བས་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡིག་པའི་གྲོགས་པོ་ཡིན་ནོ། །
en: It is for this reason that adherents of the vehicles of hearers and solitary buddhas are a bad influence for bodhisattvas.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པས་ཚུལ་ཁྲིམས་འཆལ་པའམ། ལྟ་བ་ལོག་པ་དང་ལྷན་ཅིག་དགའ་བར་བྱས་པ་ནི་རུང་གི །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དག་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: “Moreover, for those who are well founded in the vehicle of the bodhisattvas, it is permissible to fraternize with people with faulty discipline and distorted ideas, while this is not the case for the vehicles of the hearers and solitary buddhas.

source: ཚུལ་ཁྲིམས་འཆལ་པ་དང་ལྟ་བ་ལོག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རིང་དུ་སོང་བ་ཡིན་ལ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་མཐར་བྱེད་པ་གསོད་པའི་ཚུལ་དུ་བལྟ་སྟེ
en: Bodhisattvas have distanced themselves from faulty discipline and distorted ideas. Followers of the hearers and solitary buddhas should be viewed as murderers, since they terminate the presence in the vehicle of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སོ་སོར་མ་བརྟགས་པའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པ་དེ་ནི་སོ་སོར་འབད་པ་མི་ནུས་ཏེ།
en: Those bodhisattvas who are grounded in the vehicle beyond analysis become unable to pursue it.

source: དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དག་དང་ལྷན་ཅིག་དགའ་བར་མི་བྱའོ། །
en: In view of this, bodhisattvas should not fraternize with followers of the vehicles of the hearers and solitary buddhas.

source: སེང་གེ་དང་། ཝ་ལྷན་ཅིག་དགའ་བར་བྱེད་པ་ནི་རིགས་པ་མེད་དེ་
en: It is incongruous for lions to keep company with foxes.

source: ཇི་ལྟར་ཝ་ལྟ་བུ་དེ་ལྟར་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཐེག་པ་པ་ཡིན་པར་བལྟའོ། །
en: In that sense, all followers of the vehicles of the hearers and solitary buddhas should be regarded like foxes,

source: ཇི་ལྟར་སེང་གེ་ལྟ་བུ་དེ་ལྟར་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པ་ཡིན་པར་རིགས་པར་བྱའོ། །
en: whereas those who are grounded in the vehicle of bodhisattvas should be considered analogous to lions.

source: ཉན་ཐོས་ནི་བདག་ལ་ཕན་པར་ཞུགས་པ་ཡིན་གྱི། བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་གཞན་ལ་ཕན་པར་ཞུགས་པ་ཡིན་ནོ། །
en: “Hearers are involved with benefiting themselves, while bodhisattvas are involved in helping both themselves and others.

source: ཉན་ཐོས་ནི་བདག་གི་ལམ་ཤེས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་རབ་ཏུ་ཤེས་སོ། །
en: Hearers only know their own path, while bodhisattvas understand fully the paths of all sentient beings as well as their own.

source: ཉན་ཐོས་ནི་བདག་གི་སེམས་རྣམ་པར་སྦྱོང་གི །བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྣམ་པར་སྦྱོང་ངོ་། །
en: Hearers only purify their own minds, while bodhisattvas purify all sentient beings’ minds as well as their own.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ནི་བདག་གི་ཉོན་མོངས་པ་རྣམས་ཞི་བར་བྱེད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་གཞན་གྱི་ཉོན་མོངས་པ་རྣམས་ཞི་བར་བྱེད་དོ། །
en: Hearers and solitary buddhas pacify their own afflictions, while bodhisattvas pacify others’ afflictions as well as their own.

source: ཉན་ཐོས་ནི་ལམ་གཅིག་ནས་འབྲོས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་ནི་ལམ་ཆེན་པོ་ནས་འགྲོའོ། །
en: Hearers use their one path to escape, while bodhisattvas traverse the great path.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དག་ཉོན་མོངས་པ་སྤངས་ལ། བག་ཆགས་མ་སྤངས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་ཉོན་མོངས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དང་བཅས་པ་ཡང་སྤངས་སོ། །
en: Hearers and solitary buddhas abandon the afflictions but not the habits for them, while bodhisattvas, upon fully awakening to buddhahood, abandon not only the afflictions but also the habits to which they are connected.

source: ཉན་ཐོས་ནི་གཞན་གྱིས་བསྟན་པའི་ལམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའི། བྱང་ཆུབ་སེམས་དཔའ་ནི་རང་བྱུང་གི་ལམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: Hearers attain nirvāṇa via a path taught by someone else, while bodhisattvas attain nirvāṇa by means of a path that is self-manifest.

source: ཉན་ཐོས་དག་གི་དམ་པའི་ཆོས་ནི་མི་གནས་ཀྱེ། བྱང་ཆུབ་སེམས་དཔའི་དམ་པའི་ཆོས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་གནས་སོ། །
en: The sublime Dharma of the hearers does not last, while the sublime Dharma of the bodhisattvas remains after they awaken to unexcelled and perfect buddhahood.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དག་ལ་ནི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་མེད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་དག་ལ་ནི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སྟོབས་བཅུ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ། །
en: Hearers and solitary buddhas lack the excellent powers, while bodhisattvas gain the excellent ten powers upon fully awakening to buddhahood.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དག་ལ་ནི་མི་འཇིགས་པ་ཕུན་སུམ་ཚོགས་པ་མེད་ཀྱི། སངས་རྒྱས་དག་ལ་ནི་མི་འཇིགས་པ་ཕུན་སུམ་ཚོགས་པ་མངའོ། །
en: Hearers and solitary buddhas lack the excellent types of fearlessness, while buddhas master the excellent types of fearlessness.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དག་ལ་ནི་དེ་བཞིན་གཤེགས་པའི་སོ་སོར་ཡང་དག་པར་རིག་པ་མེད་ཀྱི། དེ་བཞིན་གཤེགས་པ་ལ་ནི་ཐུན་མོང་མ་ཡིན་པའི་སོ་སོར་ཡང་དག་པའི་རིག་པ་མངའོ། །
en: Hearers and solitary buddhas lack the thus-gone ones’ correct understanding, while the thus-gone ones possess extraordinarily correct understanding.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ནི་མཚན་མེད་ཀྱི། དེ་བཞིན་གཤེགས་པ་ལ་ནི་ཐུན་མོང་མ་ཡིན་པའི་མཚན་མངའོ། །
en: Hearers and solitary buddhas all lack the marks, while the thus-gone ones possess extraordinary marks.

source: དེ་བཞིན་གཤེགས་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་སློབ་པ་ནི་དཔེས་བསྟན་པ་དེ་བཞིན་ཉིད་ཡོད་དོ། །
en: “Those who train in the thus-gone ones’ correct understanding can be described by means of the following analogy.

source: དཔེས་བསྟན་པ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མི་ཤེས་པ་དེ་གང་གིས་ཚུལ་འདི་ལྟ་བུ་དེ་ལས་གཞན་པ་སྡིག་པ་མི་དགེ་བའི་ཆོས་དཔག་ཏུ་མེད་པ་དག་གིས་ཀུན་ནས་དཀྲིས་པའི་སེམས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་མཉམ་པར་འགྱུར་རོ། །
en: They can be compared to people who are ignorant of the great trichiliocosm, which causes their minds to be entirely enmeshed in limitless negativity and non-virtue, but who later gain the same qualities as a buddha.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དེ་དག་ལ་སློབ་པ་ནི་ལམ་འདི་ལྟ་བུ་ཁོང་དུ་ཆུད་པའི་ཕྱིར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་རྨོངས་པར་བྱ་མི་ནུས་ཏེ།
en: Those who cultivate these qualities of bodhisattvas realize this path and thus cannot be deluded by anyone in the world, including the gods.

source: དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་འདི་ནས་ཤི་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Thus, when bodhisattvas die in this life, they are irreversible from unexcelled and perfect awakening, and have the thought,

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་དོན་མེད་ཅིང་མིག་ཕྱུང་བ་དགེ་བའི་ཕྱོགས་དང་མི་འཐུན་པ་ལ་མངོན་པར་ཞུགས་པ་ལས་ངན་པའི་དབང་གིས་གང་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་འདོད་པ་དེ་དག་གལ་ཏེ་བརྒྱ་ལ་མཐོང་ན་མི་འཐུན་པ་དང་ཉམ་ང་བ་འཐོབ་སྟེ
en: ‘Alas! How pointlessly and blindly these sentient beings immerse themselves in all that is the opposite of virtue. Controlled by negativity, whenever they encounter a desirable sight, sound, smell, taste, or texture, they become inharmonious and dreadful.

source: དེ་ངེས་པར་འབྱུང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མི་ཤེས་སོ། །
en: They lack correct understanding of deliverance.’

source: འདི་ལྟ་སྟེ་དཔེར་ན། མི་ཞིག་ལ་སྦྲུལ་ནག་པོས་ཟིན་ན་སྦྲུལ་ལ་གནོད་པར་སེམས་ཀྱི་དུག་སྤང་བའི་ཕྱིར་འབད་པར་ནི་མི་བྱེད་དོ། །
en: For instance, if someone is bitten by a venomous snake, they will think to attack the snake rather than trying to remove the poison.

source: དེ་བཞིན་དུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ལྷའི་འདོད་པའི་དགའ་བ་ལ་མི་བདེ་བར་སེམས་ཀྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་འབད་པར་ནི་མི་བྱེད་དོ། །
en: Similarly, foolish ordinary beings become unhappy thinking about the sense pleasures of the gods instead of trying to remove their own afflictions.

source: འདི་ལྟར་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མི་ཤེས་ཏེ།
en: It is because they do not correctly understand the cause of suffering.

source: དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱ་བར་འདོད་ཅིང་། དོན་མ་ཡིན་པ་བཟློག་པར་འདོད་པས་ལས་རྣམས་ཀྱི་རྒྱུ་ཉོན་མོངས་པ་དག་སོ་སོར་ཤེས་པར་བྱའོ། །
en: Therefore bodhisattva great beings who want to benefit sentient beings and counteract what does not benefit them should understand precisely how the afflictions serve as the causes of karma.

source: མཽད་གལ་གྱི་བུ་ཉོན་མོངས་པ་གང་གིས་ལས་ཡང་དག་པར་ལེན་པ་ངས་ཤེས་ཤིང་མཐོང་བ་སྨྲས། ཟག་པ་ཟད་པ་མ་ཤེས་མ་མཐོང་བ་ཡང་ངས་སྨྲ་སྟེ།
en: “Maudgalyāyana, I have explained how to understand and recognize that afflictions lead to the appropriation of karma, just as I have explained how the end of defilements is not understood or perceived.

source: ཅི་ཤེས་ཅི་མཐོང་ཞེས་ན་འདི་ལྟ་སྟེ།
en: How is this cognized and perceived, you may ask?

source: ཚུལ་བཞིན་ཡིད་ལ་མི་བྱེད་པའོ། །
en: Through correct mental engagement and incorrect mental engagement.

source: ཚུལ་བཞིན་མ་ཡིན་པ་གང་ཞེ་ན།
en: What is incorrect mental engagement?

source: མུན་པའི་ཚོགས་གསུམ་དག་གོ། །
en: It refers to the three ways of darkness.

source: ཚུལ་བཞིན་གང་ཞེ་ན།
en: What is correct then?

source: རྣམ་པར་ཐར་བའི་སྒོ་གསུམ་སྟེ། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའོ། །
en: The three gateways to liberation: emptiness, absence of marks, and absence of wishes.

source: གང་གི་ཚེ་སྟོང་པ་ཉིད་ལ་གནས་པ་དེའི་ཚེ་བདག་དང་བདག་གི་འམ། རྟག་པའམ་བརྟན་པའམ། ཞི་བའམ་ཐེར་ཟུག་པ་ཞེས་སོམ་ཉི་མེད་ཅིང་ཐེ་ཚོམ་མེད་དོ། །
en: Once one has a basis in emptiness, there is no longer any doubt or reservation about there being a self, something that is ‘mine,’ or something that is permanent, stable, tranquil, or eternal.

source: དེའི་ངེས་པར་གྱུར་པ་རྟོགས་ནས་དེར་བདག་མེད་ཅིང་བདག་གི་མེད་པ་དེའི་ཚེ་མུན་པ་རྨོངས་པ་འདི་བཅོམ་པར་འགྱུར་ཏེ། དཔེར་ན་སྣང་བ་བྱུང་བས་མུན་པ་མེད་པར་འགྱུར་རོ། །
en: Once one has realized this with certainty, one overcomes any darkness and confusion regarding the absence of self and something being ‘mine,’ just as daylight eliminates darkness.

source: དེ་བཞིན་དུ་སྟོང་པ་ཉིད་དག་ལ་ངེས་པར་གྱུར་པས་མུན་པའི་ཚོགས་ལ་འཇིགས་པར་མི་འགྱུར་རོ། །
en: Similarly, once one has certainty about emptiness, one will no longer be threatened by the darkness.

source: དེས་ན་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པར་ཤེས་པར་འགྱུར་ཞིང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་སྒོ་འབྱེད་པར་འགྱུར་ཏེ།
en: This is how the Blessed One gains knowledge, and how the Thus-Gone One’s ten powers are revealed.

source: འདི་ལྟ་སྟེ་གནས་ཤེས་པ་དང་། གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པའི་བར་དུའོ། །
en: This can be said about knowledge of what is possible, knowledge of the origin as related to knowledge of what is possible, knowledge of cessation as related to knowledge of what is possible, knowledge of the path leading to cessation as related to knowledge of what is possible, and so on, all the way through to knowledge of the path leading to cessation as related to knowledge of omniscience.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་མུན་པ་རྨོངས་པའི་ཚོགས་གསུམ་དག་ཤེས་པར་བྱས་ལ།
en: “Therefore, Maudgalyāyana, those noble sons and daughters who are well grounded in the vehicle of the bodhisattvas and who wish to fully awaken to unexcelled and perfect buddhahood should have knowledge of the three ways of dark confusion. Moreover,

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དག་ལ་སོ་སོར་བརྟག་པར་བྱ་ཞིང་། སྟོབས་བཅུ་དག་ལ་སྨོན་ལམ་གདབ་པར་བྱའོ། །
en: they should correctly understand the three gateways to liberation and aspire toward the ten powers.

source: འཇིག་ཚོགས་དང་མུན་པའི་ཚོགས་ཀྱིས་བསྒྲིབས་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བསྐྱེད་ནས་སེམས་ཅན་རྣམས་ཀྱི་མུན་པའི་ཚོགས་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་རྣལ་འབྱོར་དུ་བྱའོ། །
en: They should develop compassion for sentient beings who are obscured by the transitory collection and darkness, and practice for the sake of revealing what sentient beings’ darknesses are.”

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་བ་མངོན་པར་ཤེས་པ་ལྔ་ཡོད་པ་གསེར་ལྡན་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the far distant past there was an impressive sage named Hiraṇyavatī who possessed magical powers and the five superknowledges.

source: དེས་སྔོན་གྱི་གནས་ཤེས་པ་ཐོབ་སྟེ།
en: He had attained knowledge of past existences.

source: དེ་ཇི་ལྟ་བུའི་ཚུལ་གྱི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་ལ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐོབ་པས། སྔོན་གྱི་བདག་གི་ངོ་བོ་ཉིད་རྗེས་སུ་དྲན་ནོ། །
en: He gained accomplishment in any absorption in which he rested, and thereby was able to recall the identities of his former selves.

source: འདས་པའི་དུས་ན་བདག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པའི་འོད་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In one particular past life he was a universal monarch named Mahāprabha , endowed with the seven royal treasures.

source: བདག་གིས་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་ཡོད་པ་གཟི་བརྗིད་དྲག་པ་དེ་ལས་གང་སྲོག་གཅོད་པ་དེ་ངན་སོང་གི་ལམ་འཛིན་ཏོ། །
en: From a sage named Intense Splendor, who possessed the five superknowledges, he learned that those who kill follow a course to the lower realms,

source: གང་སྲོག་གཅོད་པ་སྤངས་པ་དེ་མཐོ་རིས་ཀྱི་ལམ་འཛིན་ཏོ། །
en: that those who forsake killing follow a course to the higher realms,

source: གང་ཉོན་མོངས་པ་ཟད་པའི་ལམ་འཛིན་པ་དེ་ཐམས་ཅད་མཁྱེན་པའི་ལམ་འཛིན་ཏོ་ཞེས་ཐོས་སོ། །
en: and that those who bring an end to the afflictions follow a course to omniscience.

source: དེ་བདག་གིས་ཐོས་ནས་འདི་སྙམ་དུ་གྱུར་ཏེ་
en: “Hearing these teachings, he wondered,

source: ཤེས་པ་གང་ཐོབ་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འགྲོ་བ་རབ་ཏུ་ཤེས་པ་འདི་ལྟ་སྟེ།
en: ‘What knowledge will allow me to understand the migrations of all beings?

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འདི་ལྟར་ཤེས་པ་དེ་འཐོབ་པ་དེ་ནི་ལེགས་སོ། །
en: It would be so excellent and outstanding if I could know the paths that lead to all destinations.’

source: དེ་ནི་རབ་བོ་སྙམ་མོ། །
en: He also wondered,

source: རྒྱུ་གང་གིས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པའི་ལམ་དུ་འགྱུར།
en: ‘What are the causes of the knowledge of the paths that lead to all destinations?’

source: དེ་འདི་སྙམ་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Thinking further, he realized,

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་སྒྲུབ་པའི་རྒྱུ་ནི་ལས་མངོན་པར་འདུ་བྱེད་པའོ། །
en: ‘The causes that create the paths that lead to all destinations lie in the formation of karma.

source: ལས་མངོན་པར་འདུ་བྱེད་པའི་རྒྱུ་གང་ཡིན།
en: But what are the causes that lead to the formation of karma?

source: ཉོན་མོངས་པ་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་གསུམ་ནི་ལས་མངོན་པར་འདུ་བྱེད་པའི་རྒྱུའོ། །
en: The causes that lead to the formation of karma are the afflictions of desire, anger, and ignorance.

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་གི་རྒྱུ་གང་ཡིན།
en: But what are the causes of desire, anger, and ignorance?

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ནི་ལས་དང་ཉོན་མོངས་པའི་རྒྱུ་ཡིན་ཏེ།
en: The causes leading to karma and the afflictions lie in distorted mental engagement.

source: ཚུལ་བཞིན་མ་ཡིན་པར་ཞུགས་པ་ནི་ཉོན་མོངས་པ་སྐྱེ་ཞིང་ཉོན་མོངས་པས་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་མངོན་པར་འདུ་བྱེད་དོ། །
en: Distorted mental engagement produces afflictions, which in turn lead to the formation of physical, verbal, and mental karma.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ཀུན་ནས་སློང་བས་དབང་པོ་དྲུག་མངོན་པར་འགྲུབ་སྟེ།
en: Prompted by distorted mental engagement, the six sense faculties are formed, on the basis of which more afflictions come about.

source: དེ་ལ་གནས་ནས་ཡང་ཉོན་མོངས་པ་འགྲུབ་པོ། །ཡང་ཉོན་མོངས་པ་ལས་ལས་འགྲུབ་སྟེ། དེའི་ལས་ཀྱིས་ཡང་རྣམ་པར་སྨིན་པ་དབང་པོ་དྲུག་འགྲུབ་སྟེ།
en: Then again afflictions lead to the formation of karma, and that karma ripens into further formation of the six sense faculties.

source: དེ་ལྟར་སྔོན་གྱི་མཐའི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་རབ་ཏུ་མི་ཤེས་སོ། །
en: This immense amount of past suffering is what is not understood.

source: གང་དུ་སེམས་ཅན་དག་རབ་ཏུ་ཉམས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མི་ཤེས་ན་ཤེས་པ་གང་གིས་སྡུག་བསྔལ་བར་མི་འགྱུར་བ་དེ་ཇི་ལྟར་འཐོབ་པར་འགྱུར།
en: What have sentient beings failed in and what is it they do not correctly understand? What knowledge will lead to the end of suffering and how can it be achieved?’

source: གང་གིས་ཉོན་མོངས་པར་མི་འགྱུར་བ་ནི་ཚུལ་བཞིན་དུ་སོ་སོར་རིག་པ་སྟེ་ཉོན་མོངས་པ་མེད་ན། ལས་མངོན་པར་འདུ་བྱེད་པ་མེད་ལ།
en: One who has no afflictions will understand correctly. Without afflictions then, no karma will be created.

source: ལས་མངོན་པར་འདུ་བྱེད་པ་མེད་ན། དབང་པོ་དྲུག་འགྲུབ་པ་མེད་དེ་གང་ལས་མངོན་པར་འགྲུབ་པ་མེད་ན་དེ་མྱ་ངན་ལས་འདའོ། །
en: When no karma is created, the six sense faculties will not be formed. When no karma is created, that is nirvāṇa.

source: ཚུལ་བཞིན་མ་ཡིན་པ་འདི་ནི་འཁོར་བ་ཡིན་ལ། ཚུལ་བཞིན་ནི་མྱ་ངན་ལས་འདས་པའོ། །
en: To be distorted is cyclic existence, while to be undistorted is nirvāṇa.

source: ཚུལ་བཞིན་མ་ཡིན་པས་ནི་འཇུག་པར་འགྱུར་ལ། ཚུལ་བཞིན་གྱིས་ནི་ཕྱིར་ལྡོག་པར་འགྱུར་རོ། །
en: What is undertaken by distortion is undone through being undistorted.

source: ཚུལ་བཞིན་མ་ཡིན་པས་ནི་འཁོར་བའི་འཁོར་ལོར་འཁྱམ་ལ་ཚུལ་བཞིན་གྱིས་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ། །
en: By distortion one revolves in the wheel of cyclic existence, while by being undistorted one turns the wheel of Dharma.

source: ཚུལ་བཞིན་མ་ཡིན་པས་ནི་འཆིང་ལ། ཚུལ་བཞིན་གྱིས་ནི་འཐར་རོ། །
en: One is bound by distortion and freed by being undistorted.

source: གང་དེ་ལྟར་ཤེས་པ་ནི་འཁོར་བའི་ལམ་ལས་ཐར་ཞིང་མྱ་ངན་ལས་འདས་པའི་ལམ་འཐོབ་སྟེ། དེའི་སྡུག་བསྔལ་དག་ལྡོག་གོ། །
en: Whoever understands this becomes free from the paths of cyclic existence, eradicates their associated suffering, and achieves the path of nirvāṇa.’

source: དེས་ལས་ཐམས་ཅད་ཀྱི་རྣམ་པར་སྨིན་པ་དབང་པོ་དྲུག་གི་ཤེས་པ་ཐོབ་ནས་སྐྱེ་བོའི་ཚོགས་དེར་རབ་ཏུ་བཙུད་དོ། །
en: “Once Mahāprabha attained knowledge of the six sense faculties as the ripening of all karma, he entered among the multitudes of beings.
